In [1]:
import pandas as pd

In [2]:
lis = [2,5,8,10,7]
type(lis)

list

In [4]:
s = pd.Series(lis)
s.dtype

dtype('int64')

In [5]:
dic = [
    {"name":"snehal","age":25},
    {"name":"Ish","age":20}
]
dic

[{'name': 'snehal', 'age': 25}, {'name': 'Ish', 'age': 20}]

In [6]:
type(dic)

list

In [7]:
df = pd.DataFrame(dic)
df

     name  age
0  snehal   25
1     Ish   20

In [8]:
data = pd.read_csv('BostonHousing.csv')
type(data)
data

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [9]:
data.tail(2)

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [10]:
data.shape

(506, 14)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   crim     506 non-null    float64
 1   zn       506 non-null    float64
 2   indus    506 non-null    float64
 3   chas     506 non-null    int64
 4   nox      506 non-null    float64
 5   rm       506 non-null    float64
 6   age      506 non-null    float64
 7   dis      506 non-null    float64
 8   rad      506 non-null    int64
 9   tax      506 non-null    int64
 10  ptratio  506 non-null    float64
 11  b        506 non-null    float64
 12  lstat    506 non-null    float64
 13  medv     506 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 55.5 KB

In [12]:
data.isnull().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
b          0
lstat      0
medv       0
dtype: int64

In [13]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
501    False
502    False
503    False
504    False
505    False
Length: 506, dtype: bool

In [14]:
data.iloc[4:8,[1,3]]

     zn  chas
4   0.0     0
5   0.0     0
6  12.5     0
7  12.5     0

In [15]:
data.loc[:,['b','age']]

          b   age
0    396.90  65.2
1    396.90  78.9
2    392.83  61.1
3    394.63  45.8
4    396.90  54.2
..      ...   ...
501  391.99  69.1
502  396.90  76.7
503  396.90  91.0
504  393.45  89.3
505  396.90  80.8

[506 rows x 2 columns]

In [16]:
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [18]:
s.dtype

dtype('int64')

In [19]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
s.values

array([ 2,  5,  8, 10,  7])

In [22]:
s.loc[1:3]

1     5
2     8
3    10
dtype: int64

In [23]:
dict1 = {"name":"snehal","age":12}

In [25]:
s2 = pd.Series(dict1)
s2

name    snehal
age         12
dtype: object

In [26]:
import numpy as np
dict2 = [
    {"name":"snehal","age":np.nan},
    {"name":"ishwari","age":13},
    {"name":"anjua","age":13},
    {"name":"anjua","age":24},
    {"name":None ,"age":50}
]
dict2
df2 = pd.DataFrame(dict2)
df2

      name   age
0   snehal   NaN
1  ishwari  13.0
2    anjua  13.0
3    anjua  24.0
4     None  50.0

In [27]:
df2.isnull().sum()

name    1
age     1
dtype: int64

In [28]:
df2['name'].fillna("sham",inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_21068\1429768443.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['name'].fillna("sham",inplace=True)

In [29]:
avg = df2['age'].mean()
avg1 = int(avg)
avg1

25

In [30]:
df2['age'].fillna(avg1,inplace=True)

df2

C:\Users\Admin\AppData\Local\Temp\ipykernel_21068\2259298842.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['age'].fillna(avg1,inplace=True)

      name   age
0   snehal  25.0
1  ishwari  13.0
2    anjua  13.0
3    anjua  24.0
4     sham  50.0

In [31]:
df2

      name   age
0   snehal  25.0
1  ishwari  13.0
2    anjua  13.0
3    anjua  24.0
4     sham  50.0

In [32]:
df2.values

array([['snehal', 25.0],
       ['ishwari', 13.0],
       ['anjua', 13.0],
       ['anjua', 24.0],
       ['sham', 50.0]], dtype=object)

In [33]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
df2.dtypes

name     object
age     float64
dtype: object

In [35]:
df2[df2 == 13]

  name   age
0  NaN   NaN
1  NaN  13.0
2  NaN  13.0
3  NaN   NaN
4  NaN   NaN